Repository: Cur10s1tyByt3/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/develop.po
Languages: ta

source: Developing OnionShare
ta: வெங்காயத்தை உருவாக்குதல்

source: Collaborating
ta: ஒத்துழைப்பு

source: OnionShare has an open Keybase team to discuss the project, ask questions, share ideas and designs, and making plans for future development. (It's also an easy way to send end-to-end encrypted direct messages to others in the OnionShare community, like OnionShare addresses.) To use Keybase, download the `Keybase app <https://keybase.io/download>`_, make an account, and `join this team <https://keybase.io/team/onionshare>`_. Within the app, go to "Teams", click "Join a Team", and type "onionshare".
ta: இந்த திட்டத்தைப் பற்றி விவாதிக்கவும், கேள்விகளைக் கேட்கவும், சிந்தனைகள் மற்றும் வடிவமைப்புகளைப் பகிர்ந்து கொள்ளவும், எதிர்கால வளர்ச்சிக்கான திட்டங்களை உருவாக்கவும் வெங்காயர் ஒரு திறந்த கீபேச் குழுவைக் கொண்டுள்ளது. . பயன்பாட்டிற்குள், "அணிகள்" க்குச் சென்று, "ஒரு குழுவில் சேர" என்பதைக் சொடுக்கு செய்து, "வெங்காயர்" என்று தட்டச்சு செய்க.

source: OnionShare also has a `mailing list <https://lists.riseup.net/www/subscribe/onionshare-dev>`_ for developers and and designers to discuss the project.
ta: வெங்காயத்தில் `அஞ்சல் பட்டியல் <https://lists.riseup.net/www/subscrice/onionshare-dev>` _ உருவாக்குபவர்கள் மற்றும் வடிவமைப்பாளர்கள் திட்டத்தைப் பற்றி விவாதிக்க.

source: Contributing Code
ta: குறியீடு பங்களிப்பு

source: OnionShare source code is to be found in this Git repository: https://github.com/onionshare/onionshare
ta: இந்த அறிவிலி களஞ்சியத்தில் வெங்காய மூலக் குறியீடு காணப்படுகிறது: https://github.com/onionshare/onionshare

source: If you'd like to contribute code to OnionShare, it helps to join the Keybase team and ask questions about what you're thinking of working on. You should also review all of the `open issues <https://github.com/onionshare/onionshare/issues>`_ on GitHub to see if there are any you'd like to tackle.
ta: நீங்கள் வெங்காயத்தில் குறியீட்டை பங்களிக்க விரும்பினால், இது கீபேச் குழுவில் சேர உதவுகிறது மற்றும் நீங்கள் என்ன வேலை செய்கிறீர்கள் என்று கேள்விகளைக் கேட்க உதவுகிறது. நீங்கள் சமாளிக்க விரும்பும் ஏதேனும் இருக்கிறதா என்று கிதுபில் `திறந்த சிக்கல்கள் <https://github.com/onionshare/onionshare/issues> _ _.

source: When you're ready to contribute code, open a pull request in the GitHub repository and one of the project maintainers will review it and possibly ask questions, request changes, reject it, or merge it into the project.
ta: குறியீட்டை பங்களிக்க நீங்கள் தயாராக இருக்கும்போது, கிட்அப் களஞ்சியத்தில் ஒரு இழுப்பு கோரிக்கையைத் திறக்கவும், திட்ட பராமரிப்பாளர்களில் ஒருவர் அதை மதிப்பாய்வு செய்து கேள்விகளைக் கேட்பார், மாற்றங்களைக் கோருவார், அதை நிராகரிக்கலாம் அல்லது திட்டத்தில் ஒன்றிணைப்பார்.

source: Starting Development
ta: தொடக்க வளர்ச்சி

source: OnionShare is developed in Python. To get started, clone the Git repository at https://github.com/onionshare/onionshare/ and then consult the ``cli/README.md`` file to learn how to set up your development environment for the command-line version, and the ``desktop/README.md`` file to learn how to set up your development environment for the graphical version.
ta: வெங்காயர் பைத்தானில் உருவாக்கப்பட்டுள்ளது. தொடங்குவதற்கு, https://github.com/onionshare/onionshare/ இல் உள்ள சிஐடி களஞ்சியத்தை நகலி செய்து, பின்னர் கட்டளை-வரி பதிப்பிற்கான உங்கள் மேம்பாட்டு சூழலை எவ்வாறு அமைப்பது என்பதை அறிய `` கிளி/ரீட்மெ.

source: Those files contain the necessary technical instructions and commands install dependencies for your platform, and to run OnionShare from the source tree.
ta: அந்த கோப்புகளில் தேவையான தொழில்நுட்ப வழிமுறைகள் மற்றும் கட்டளைகள் உங்கள் தளத்திற்கான சார்புகளை நிறுவுகின்றன, மேலும் மூல மரத்திலிருந்து வெங்காயத்தை இயக்குகின்றன.

source: Debugging tips
ta: பிழைத்திருத்த உதவிக்குறிப்புகள்

source: Verbose mode
ta: சொற்களஞ்சிய ஃபேசன்

source: When developing, it's convenient to run OnionShare from a terminal and add the ``--verbose`` (or ``-v``) flag to the command. This prints a lot of helpful messages to the terminal, such as when certain objects are initialized, when events occur (like buttons clicked, settings saved or reloaded), and other debug info. For example::
ta: வளரும் போது, ஒரு முனையத்திலிருந்து வெங்காயத்தை இயக்குவது வசதியானது மற்றும் கட்டளையில் `` --verbose`` (அல்லது `` -v```) கொடியைச் சேர்ப்பது வசதியானது. இது முனையத்திற்கு நிறைய பயனுள்ள செய்திகளை அச்சிடுகிறது, அதாவது சில பொருள்கள் துவக்கப்படும்போது, நிகழ்வுகள் நிகழும்போது (பொத்தான்கள் சொடுக்கு செய்யப்பட்டது, அமைப்புகள் சேமிக்கப்பட்டவை அல்லது மீண்டும் ஏற்றப்பட்டன) மற்றும் பிற பிழைத்திருத்த தகவல்கள். உதாரணமாக ::

source: You can add your own debug messages by running the ``Common.log`` method from ``onionshare/common.py``. For example::
ta: `` வெங்காயர்/காமன்.பை`` இலிருந்து `` காமன்.லாக்`` முறையை இயக்குவதன் மூலம் உங்கள் சொந்த பிழைத்திருத்த செய்திகளைச் சேர்க்கலாம். உதாரணமாக ::

source: This can be useful when learning the chain of events that occur when using OnionShare, or the value of certain variables before and after they are manipulated.
ta: வெங்காயத்தைப் பயன்படுத்தும் போது நிகழும் நிகழ்வுகளின் சங்கிலியையும் அல்லது சில மாறிகள் கையாளப்படுவதற்கு முன்னும் பின்னும் அவை கையாளப்படுவதற்கு முன்னும் பின்னும் கற்றுக்கொள்ளும்போது இது பயனுள்ளதாக இருக்கும்.

source: Local Only
ta: உள்ளக மட்டும்

source: Tor is slow, and it's often convenient to skip starting onion services altogether during development. You can do this with the ``--local-only`` flag. For example::
ta: டோர் மெதுவாக உள்ளது, மேலும் வளர்ச்சியின் போது வெங்காய சேவைகளை முழுவதுமாகத் தவிர்ப்பது பெரும்பாலும் வசதியானது. ``-உள்ளூர்-மட்டும்`` கொடியுடன் இதைச் செய்யலாம். உதாரணமாக ::

source: In this case, you load the URL ``http://127.0.0.1:17641`` in a normal web-browser like Firefox, instead of using the Tor Browser. The private key is not actually needed in local-only mode, so you can ignore it.
ta: இந்த வழக்கில், நீங்கள் முகவரி `` http: //127.0.0.1: 17641`` ஐ டோர் உலாவியைப் பயன்படுத்துவதற்குப் பதிலாக பயர்பாக்ச் போன்ற சாதாரண வலை-உலாவியில் ஏற்றுகிறீர்கள். தனிப்பட்ட விசை உண்மையில் உள்ளக மட்டும் பயன்முறையில் தேவையில்லை, எனவே நீங்கள் அதை புறக்கணிக்கலாம்.

source: Contributing Translations
ta: மொழிபெயர்ப்புகள் பங்களிப்பு

source: Help make OnionShare easier to use and more familiar and welcoming for people by translating it on `Hosted Weblate <https://hosted.weblate.org/projects/onionshare/>`_. Always keep the "OnionShare" in latin letters, and use "OnionShare (localname)" if needed.
ta: `ஓச்ட் செய்யப்பட்ட வலைபெயர்ப்பு <https://hosted.weblate.org/projects/onionshare/>` _ இல் மொழிபெயர்ப்பதன் மூலம் வெங்காயத்தை எளிதாகப் பயன்படுத்தவும், மிகவும் பழக்கமாகவும் வரவேற்பதையும் உதைக்க உதவுங்கள். லத்தீன் எழுத்துக்களில் எப்போதும் "வெங்காயத்தை" வைத்திருங்கள், தேவைப்பட்டால் "வெங்காயம் (உள்ளூர் பெயர்)" ஐப் பயன்படுத்தவும்.

source: To help translate, make a Hosted Weblate account and start contributing.
ta: மொழிபெயர்க்க உதவ, புரவலன் செய்யப்பட்ட வலைபெயர்ப்பு கணக்கை உருவாக்கி பங்களிக்கத் தொடங்குங்கள்.

source: Suggestions for Original English Strings
ta: அசல் ஆங்கில சரங்களுக்கான பரிந்துரைகள்

source: Sometimes the original English strings are wrong, or don't match between the application and the documentation.
ta: சில நேரங்களில் அசல் ஆங்கில சரங்கள் தவறானவை, அல்லது பயன்பாட்டிற்கும் ஆவணங்களுக்கும் இடையில் பொருந்தாது.

source: File source string improvements by adding @kingu to your Weblate comment, or open a GitHub issue or pull request. The latter ensures all upstream developers see the suggestion, and can potentially modify the string via the usual code review processes.
ta: உங்கள் வலைபெயர்ப்பு கருத்தில் @Kingu ஐ சேர்ப்பதன் மூலம் மூல மூல சரம் மேம்பாடுகளை கோப்பு அல்லது அறிவிலிமையம் சிக்கலைத் திறக்கவும் அல்லது கோரிக்கையை இழுக்கவும். பிந்தையது அனைத்து மேலோடை டெவலப்பர்களும் ஆலோசனையைப் பார்ப்பதை உறுதிசெய்கிறது, மேலும் வழக்கமான குறியீடு மறுஆய்வு செயல்முறைகள் வழியாக சரத்தை மாற்றியமைக்க முடியும்.

source: Status of Translations
ta: மொழிபெயர்ப்புகளின் நிலை

source: Here is the current translation status. If you want start a translation in a language not yet started, please write to the mailing list: onionshare-dev@lists.riseup.net
ta: தற்போதைய மொழிபெயர்ப்பு நிலை இங்கே. இதுவரை தொடங்கப்படாத மொழியில் மொழிபெயர்ப்பைத் தொடங்க விரும்பினால், தயவுசெய்து அஞ்சல் பட்டியலில் எழுதுங்கள்: வெங்காயர்-dev@lists.riseup.net
