Repository: Cur10s1tyByt3/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/tor.po
Languages: ta

source: Connecting to Tor
ta: TOR உடன் இணைக்கிறது

source: When OnionShare starts, it will show you a screen asking you to connect to the Tor network.
ta: வெங்காயர் தொடங்கும் போது, TOR நெட்வொர்க்குடன் இணைக்கக் கேட்கும் ஒரு திரையை அது காண்பிக்கும்.

source: You can toggle on the switch "Connect to Tor automatically" before clicking "Connect to Tor". This means that next time OnionShare starts, it will automatically connect with its Tor connection settings from the last session, instead of presenting you with the connection options. If the connection fails, you can still try bridges or reconfigure Tor via the "Network Settings" button.
ta: "டோர் உடன் இணைக்கவும்" என்பதைக் சொடுக்கு செய்வதற்கு முன் "தானாகவே இணைக்கவும்" சுவிட்சில் நீங்கள் மாற்றலாம். இதன் பொருள் அடுத்த முறை வெங்காயர் தொடங்குகிறது, இது இணைப்பு விருப்பங்களை உங்களுக்கு வழங்குவதற்குப் பதிலாக, கடைசி அமர்விலிருந்து அதன் டோர் இணைப்பு அமைப்புகளுடன் தானாகவே இணைக்கும். இணைப்பு தோல்வியுற்றால், நீங்கள் இன்னும் பாலங்கள் முயற்சி செய்யலாம் அல்லது "பிணைய அமைப்புகள்" பொத்தானை வழியாக டோர் மறுகட்டமைக்கலாம்.

source: You can click "Connect to Tor" to begin the connection process. If there are no problems with your network, including any attempts to block your access to the Tor network, this should hopefully work the first time.
ta: இணைப்பு செயல்முறையைத் தொடங்க "டோர் உடன் இணைக்கவும்" என்பதைக் சொடுக்கு செய்யலாம். டோர் நெட்வொர்க்கிற்கான உங்கள் அணுகலைத் தடுப்பதற்கான ஏதேனும் முயற்சிகள் உட்பட, உங்கள் நெட்வொர்க்கில் எந்தப் பிரச்சினையும் இல்லை என்றால், இது முதல் முறையாக வேலை செய்ய வேண்டும்.

source: Or, if you want to manually configure Bridges or other Tor settings before you connect, you can click "Network Settings".
ta: அல்லது, நீங்கள் இணைப்பதற்கு முன் பாலங்கள் அல்லது பிற TOR அமைப்புகளை கைமுறையாக உள்ளமைக்க விரும்பினால், நீங்கள் "பிணைய அமைப்புகள்" என்பதைக் சொடுக்கு செய்யலாம்.

source: Automatic censorship circumvention
ta: தானியங்கி தணிக்கை சுற்றளவு

source: When you click "Connect to Tor", if OnionShare fails to connect, it might be because Tor is censored in your country or on your local network.
ta: நீங்கள் "டோர் உடன் இணைக்கவும்" என்பதைக் சொடுக்கு செய்யும்போது, வெங்காயர் இணைக்கத் தவறினால், டோர் உங்கள் நாட்டிலோ அல்லது உங்கள் உள்ளக நெட்வொர்க்கிலோ தணிக்கை செய்யப்படுவதால் இருக்கலாம்.

source: If this occurs, you will have these choices:
ta: இது ஏற்பட்டால், உங்களுக்கு இந்த தேர்வுகள் இருக்கும்:

source: Try again without a bridge
ta: பாலம் இல்லாமல் மீண்டும் முயற்சிக்கவும்

source: Automatically determine my country from my IP address for bridge settings
ta: பாலம் அமைப்புகளுக்கான எனது ஐபி முகவரியிலிருந்து எனது நாட்டை தானாகவே தீர்மானிக்கவும்

source: Manually select my country for bridge settings
ta: பாலம் அமைப்புகளுக்கு கைமுறையாக எனது நாட்டைத் தேர்ந்தெடுக்கவும்

source: If you choose the "Try again without a bridge" option, OnionShare will retry connecting to Tor like normal, without attempting to bypass censorship.
ta: "பாலம் இல்லாமல் மீண்டும் முயற்சிக்கவும்" விருப்பத்தை நீங்கள் தேர்வுசெய்தால், தணிக்கை செய்வதைத் தவிர்ப்பதற்கு முயற்சிக்காமல், வெங்காயம் சாதாரணமானதைப் போல டோர் இணைப்பதை மீண்டும் முயற்சிக்கும்.

source: The other two options will attempt to automatically bypass censorship using Tor bridges. If your network provider is blocking access to the Tor network, you can hopefully still connect to a Tor bridge, which will then connect you to the Tor network, circumventing the censorship. Both of these options use the Tor Project's Censorship Circumvention API to provide you with bridge settings that should work for you. OnionShare will temporarily use the `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ domain-fronting proxy to make a non-Tor connection from your computer to Tor's Censorship Circumvention API. The Meek proxy hides the fact that you are trying to find a way to connect to Tor.
ta: மற்ற இரண்டு விருப்பங்களும் டோர் பிரிட்சசைப் பயன்படுத்தி தணிக்கை தானாகவே புறக்கணிக்க முயற்சிக்கும். உங்கள் பிணையம் வழங்குநர் TOR நெட்வொர்க்குக்கான அணுகலைத் தடுக்கிறார் என்றால், நீங்கள் இன்னும் ஒரு TOR பாலத்துடன் இணைக்க முடியும், அது உங்களை டோர் நெட்வொர்க்குடன் இணைத்து, தணிக்கையைத் தடுக்கும். இந்த இரண்டு விருப்பங்களும் உங்களுக்காக வேலை செய்ய வேண்டிய பாலம் அமைப்புகளை உங்களுக்கு வழங்க TOR திட்டத்தின் தணிக்கை சுற்றறிக்கை பநிஇ ஐப் பயன்படுத்துகின்றன. வெங்காயர் தற்காலிகமாக `சாந்தமான <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ டொமைன்-ஃப்ரோன்டிங் பதிலாள் சுற்றளவு பநிஇ. டோருடன் இணைக்க ஒரு வழியைக் கண்டுபிடிக்க நீங்கள் முயற்சிக்கிறீர்கள் என்ற உண்மையைச் சாந்தகுணமுள்ள பதிலாள் மறைக்கிறது.

source: If you choose "Automatically determine my country from my IP address for bridge settings", the Censorship Circumvention API will consider your IP address (yes, your real IP address) to determine what country you might reside in. Based on the country information, the API will try to automatically find bridges that suit your location.
ta: "பாலம் அமைப்புகளுக்கான எனது ஐபி முகவரியிலிருந்து எனது நாட்டை தானாகவே தீர்மானித்தல்" என்பதை நீங்கள் தேர்வுசெய்தால், நீங்கள் எந்த நாட்டில் வசிக்கக்கூடும் என்பதை தீர்மானிக்க தணிக்கை சுற்றறிக்கை பநிஇ உங்கள் ஐபி முகவரியை (ஆம், உங்கள் உண்மையான ஐபி முகவரி) பரிசீலிக்கும். நாட்டின் தகவல்களின் அடிப்படையில், தி உங்கள் இருப்பிடத்திற்கு ஏற்ற பாலங்களை தானாகவே கண்டுபிடிக்க பநிஇ முயற்சிக்கும்.

source: If you choose "Manually select my country for bridge settings", the Censorship API will find the bridges that suit the country that you specified.
ta: "பாலம் அமைப்புகளுக்கு எனது நாட்டைத் தேர்ந்தெடுக்கவும்" என்பதை நீங்கள் தேர்வுசெய்தால், நீங்கள் குறிப்பிட்ட நாட்டிற்கு ஏற்ற பாலங்களை தணிக்கை பநிஇ கண்டுபிடிக்கும்.

source: How automatic censorship circumvention works
ta: தானியங்கி தணிக்கை சுற்றளவு எவ்வாறு செயல்படுகிறது

source: If the Censorship Circumvention API finds bridges that it believes will suit you, OnionShare will try to reconnect to Tor using those bridges. If the API does not find any bridges for your location, OnionShare will ask the API for "fallback" options, and then try to reconnect using those.
ta: தணிக்கை சுற்றறிக்கை பநிஇ உங்களுக்கு ஏற்றதாக இருக்கும் என்று நம்பும் பாலங்களை கண்டறிந்தால், வெங்காயர் அந்த பாலங்களைப் பயன்படுத்தி டோருடன் மீண்டும் இணைக்க முயற்சிக்கும். உங்கள் இருப்பிடத்திற்கான பநிஇ எந்த பாலங்களையும் கண்டுபிடிக்கவில்லை என்றால், வெங்காயர் பநிஇ "குறைவடையும்" விருப்பங்களைக் கேட்பார், பின்னர் அவற்றைப் பயன்படுத்தி மீண்டும் இணைக்க முயற்சிப்பார்.

source: If for some reason OnionShare fails to connect to the Censorship API itself, or if the API returns an error message, OnionShare will attempt to use the obfs4 built-in bridges.
ta: சில காரணங்களால் வெங்காயர் தணிக்கை பநிஇ உடன் இணைக்கத் தவறினால், அல்லது பநிஇ ஒரு பிழை செய்தியை வழங்கினால், வெங்காயர்சேர் OBFS4 உள்ளமைக்கப்பட்ட பாலங்களைப் பயன்படுத்த முயற்சிக்கும்.

source: It's important to note that the requests to the Censorship Circumvention API do not go over the Tor network (because if you could connect to Tor already, you wouldn't need to connect to the API).
ta: தணிக்கை சுற்றறிக்கை பநிஇ க்கான கோரிக்கைகள் TOR நெட்வொர்க்கில் செல்லாது என்பதை கவனத்தில் கொள்ள வேண்டியது தேவை (ஏனென்றால் நீங்கள் ஏற்கனவே TOR உடன் இணைக்க முடிந்தால், நீங்கள் பநிஇ உடன் இணைக்க தேவையில்லை).

source: Even though it's hard for an adversary to discover where the Meek request is going, this may still be risky for some users. Therefore, it is an opt-in feature. The use of Meek and non-torified network requests are limited only to making one or two requests to the Censorship Circumvention API. Then Meek is stopped, and all further network requests happen over the Tor network.
ta: சாந்தகுணமுள்ள கோரிக்கை எங்கு செல்கிறது என்பதைக் கண்டுபிடிப்பது ஒரு விரோதிக்கு கடினமாக இருந்தாலும், சில பயனர்களுக்கு இது இன்னும் ஆபத்தானது. எனவே, இது ஒரு விருப்ப அம்சமாகும். மீக் மற்றும் திசைதிருப்பப்படாத பிணையம் கோரிக்கைகளின் பயன்பாடு தணிக்கை சுற்றறிக்கை பநிஇ க்கு ஒன்று அல்லது இரண்டு கோரிக்கைகளைச் செய்வதற்கு மட்டுமே. பின்னர் மீக் நிறுத்தப்பட்டு, மேலும் அனைத்து பிணையம் கோரிக்கைகளும் TOR நெட்வொர்க்கில் நிகழ்கின்றன.

source: If you are uncomfortable with making a request that doesn't go over the Tor network, you can click "Network Settings" (or the Settings icon in the bottom right corner, followed by the Tor Settings tab in the screen that appears), and manually configure bridges. After you save any bridge settings, OnionShare will try to reconnect using those bridges.
ta: TOR நெட்வொர்க்கில் செல்லாத ஒரு கோரிக்கையை உருவாக்குவதில் உங்களுக்கு சங்கடமாக இருந்தால், நீங்கள் "பிணைய அமைப்புகள்" (அல்லது கீழ் வலது மூலையில் உள்ள அமைப்புகள் ஐகானைக் சொடுக்கு செய்யலாம், அதைத் தொடர்ந்து திரையில் டோர் அமைப்புகள் தாவல்), மற்றும் கைமுறையாக பாலங்களை உள்ளமைக்கவும். நீங்கள் எந்த பாலம் அமைப்புகளையும் சேமித்த பிறகு, வெங்காயம் அந்த பாலங்களைப் பயன்படுத்தி மீண்டும் இணைக்க முயற்சிக்கும்.

source: Manually configure Tor settings
ta: TOR அமைப்புகளை கைமுறையாக உள்ளமைக்கவும்

source: You can get to the Tor settings by clicking "Network Settings" on the welcome screen, or by clicking the "⚙" icon in the bottom-right corner of the application, and then switch to the Tor Settings tab in the screen that appears.
ta: வரவேற்புத் திரையில் "பிணையம் அமைப்புகளை" சொடுக்கு செய்வதன் மூலம் அல்லது பயன்பாட்டின் கீழ்-வலது மூலையில் உள்ள "⚙" ஐகானைக் சொடுக்கு செய்வதன் மூலம் நீங்கள் TOR அமைப்புகளைப் பெறலாம், பின்னர் தோன்றும் திரையில் உள்ள TOR அமைப்புகள் தாவலுக்கு மாறலாம்.

source: Here are the different ways you can configure OnionShare to connect to Tor:
ta: டோருடன் இணைக்க நீங்கள் வெங்காயத்தை கட்டமைக்கக்கூடிய பல்வேறு வழிகள் இங்கே:

source: Use the Tor version built into OnionShare
ta: வெங்காயத்தில் கட்டப்பட்ட TOR பதிப்பைப் பயன்படுத்தவும்

source: This is the default, simplest and most reliable way that OnionShare connects to Tor. For this reason, it's recommended for most users.
ta: இது வெங்காயம்சேர் TOR உடன் இணைக்கும் இயல்புநிலை, எளிமையான மற்றும் மிகவும் நம்பகமான வழியாகும். இந்த காரணத்திற்காக, இது பெரும்பாலான பயனர்களுக்கு பரிந்துரைக்கப்படுகிறது.

source: When you open OnionShare, it launches an already configured ``tor`` process in the background for OnionShare to use. It doesn't interfere with other ``tor`` processes on your computer, so you can use the Tor Browser or the system ``tor`` on their own.
ta: நீங்கள் வெங்காயத்தை திறக்கும்போது, வெங்காயம்சேர் பயன்படுத்த பின்னணியில் ஏற்கனவே கட்டமைக்கப்பட்ட `` TOR`` செயல்முறையை இது தொடங்குகிறது. இது உங்கள் கணினியில் மற்ற `` டோர்`` செயல்முறைகளில் தலையிடாது, எனவே நீங்கள் டோர் உலாவி அல்லது கணினியை `` டோர்`` சொந்தமாகப் பயன்படுத்தலாம்.

source: **Using bridges**
ta: ** பாலங்களைப் பயன்படுத்துதல் **

source: To use a bridge, you must select "Use the Tor version built into OnionShare" and check the "Use a bridge" checkbox.
ta: ஒரு பாலத்தைப் பயன்படுத்த, நீங்கள் "வெங்காயத்தில் கட்டப்பட்ட TOR பதிப்பைப் பயன்படுத்தவும்" என்பதைத் தேர்ந்தெடுத்து "ஒரு பாலத்தைப் பயன்படுத்தவும்" தேர்வுப்பெட்டியை சரிபார்க்க வேண்டும்.

source: Try using a built-in bridge first. Using `obfs4` or `snowflake` bridges is recommended over using `meek-azure`.
ta: முதலில் ஒரு உள்ளமைக்கப்பட்ட பாலத்தைப் பயன்படுத்த முயற்சிக்கவும். `OBFS4` அல்லது` ச்னோஃப்ளேக்` பாலங்களைப் பயன்படுத்துவது `சாந்தகுணப்படும்-ஏசூர்` ஐப் பயன்படுத்த பரிந்துரைக்கப்படுகிறது.

source: If using a built-in bridge doesn't work, you can request a bridge from torproject.org. You will have to solve a CAPTCHA in order to request a bridge. (This makes it more difficult for governments or ISPs to block access to Tor bridges.)
ta: உள்ளமைக்கப்பட்ட பாலத்தைப் பயன்படுத்துவது வேலை செய்யவில்லை என்றால், நீங்கள் torproject.org இலிருந்து ஒரு பாலத்தை கோரலாம். ஒரு பாலம் கோர நீங்கள் ஒரு கேப்ட்சாவை தீர்க்க வேண்டும். (இது அரசாங்கங்கள் அல்லது ISP களுக்கு TOR பாலங்களுக்கான அணுகலைத் தடுப்பது மிகவும் கடினமானது.)

source: You also have the option of using a bridge that you learned about from a trusted source.
ta: நம்பகமான மூலத்திலிருந்து நீங்கள் கற்றுக்கொண்ட ஒரு பாலத்தைப் பயன்படுத்துவதற்கான விருப்பமும் உங்களிடம் உள்ளது.

source: Attempt auto-configuration with Tor Browser
ta: டோர் உலாவியுடன் தானாக கட்டமைப்பை முயற்சிக்கவும்

source: If you have `downloaded the Tor Browser <https://www.torproject.org>`_ and don't want two ``tor`` processes running, you can use the ``tor`` process from the Tor Browser. Keep in mind you need to keep Tor Browser open in the background while you're using OnionShare for this to work.
ta: நீங்கள் `டோர் உலாவியை <https://www.torproject.org> _ _ _ மற்றும் இரண்டு` டோர்`` செயல்முறைகளை இயக்க விரும்பவில்லை என்றால், நீங்கள் டோர் உலாவியில் இருந்து `` TOR`` செயல்முறையைப் பயன்படுத்தலாம். இது வேலை செய்ய நீங்கள் வெங்காயம் பயன்படுத்தும்போது டோர் உலாவியை பின்னணியில் திறந்து வைக்க வேண்டும் என்பதை நினைவில் கொள்ளுங்கள்.

source: Using a system ``tor`` in Windows
ta: சாளரங்களில் `` TOR`` ஒரு கணினியைப் பயன்படுத்துதல்

source: This is fairly advanced. You'll need to know how edit plaintext files and do stuff as an administrator.
ta: இது மிகவும் மேம்பட்டது. எளிய உரை கோப்புகளை எவ்வாறு திருத்தி நிர்வாகியாகச் செய்ய வேண்டும் என்பதை நீங்கள் அறிந்து கொள்ள வேண்டும்.

source: Download the Tor Windows Expert Bundle `from the Tor website <https://www.torproject.org/download/tor/>`_. Extract the compressed file and copy the extracted folder to ``C:\Program Files (x86)\`` Rename the extracted folder with ``Data`` and ``Tor`` in it to ``tor-win32``.
ta: TOR சாளரங்கள் வல்லுநர் மூட்டை `டோர் வலைத்தளத்திலிருந்து <https://www.torproject.org/download/tor/>`_ இலிருந்து பதிவிறக்கவும். சுருக்கப்பட்ட கோப்பைப் பிரித்தெடுத்து, பிரித்தெடுக்கப்பட்ட கோப்புறையை `` சி: \ நிரல் கோப்புகள் (x86) `` `` பிரித்தெடுக்கப்பட்ட கோப்புறையை `` தரவு`` மற்றும் ``டோர்`` ஆகியவற்றுடன் ``டோர்-வின் 32`` க்கு நகலெடுக்கவும்.

source: Make up a control port password. (Using 7 words in a sequence like ``comprised stumble rummage work avenging construct volatile`` is a good idea for a password.) Now open a command prompt (``cmd``) as an administrator, and use ``tor.exe --hash-password`` to generate a hash of your password. For example::
ta: கட்டுப்பாட்டு துறைமுக கடவுச்சொல்லை உருவாக்கவும். . உங்கள் கடவுச்சொல்லின் ஆசை உருவாக்க exe--hash-password``. உதாரணமாக ::

source: The hashed password output is displayed after some warnings (which you can ignore). In the case of the above example, it is ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.
ta: ஆசெட் கடவுச்சொல் வெளியீடு சில எச்சரிக்கைகளுக்குப் பிறகு காட்டப்படும் (நீங்கள் புறக்கணிக்கலாம்). மேற்கூறிய எடுத்துக்காட்டின் விசயத்தில், இது `` 16: 00322E903D96DE986058BBDA91E010D7A8637668635AC38E213FDBEF``.

source: Now create a new text file at ``C:\Program Files (x86)\tor-win32\torrc`` and put your hashed password output in it, replacing the ``HashedControlPassword`` with the one you just generated::
ta: இப்போது `` சி: \ நிரல் கோப்புகள் (x86) \ டோர்-வின் 32 \ டோர்க்`` என்ற புதிய உரை கோப்பை உருவாக்கி, அதில் உங்கள் ஆசெட் கடவுச்சொல் வெளியீட்டை வைத்து, `` ஆசெட் கன்ட்ரோல் பாச் வேர்ட்`` ஐ மாற்றவும் ::

source: In your administrator command prompt, install ``tor`` as a service using the appropriate ``torrc`` file you just created (as described in `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). Like this::
ta: உங்கள் நிர்வாகி கட்டளை வரியில், நீங்கள் உருவாக்கிய பொருத்தமான `` டோர்க்`` கோப்பைப் பயன்படுத்தி `` டோர்`` ஐ ஒரு சேவையாக நிறுவவும் (`<https://2019.Www.torproject.org/docs/faq.html இல் விவரிக்கப்பட்டுள்ளது .en#ntservice> `_). இது போன்றது ::

source: You are now running a system ``tor`` process in Windows!
ta: நீங்கள் இப்போது சாளரங்களில் ஒரு கணினியை `` TOR`` செயல்முறையை இயக்குகிறீர்கள்!

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using control port", and set "Control port" to ``127.0.0.1`` and "Port" to ``9051``. Under "Tor authentication settings" choose "Password" and set the password to the control port password you picked above. Click the "Test Connection to Tor" button. If all goes well, you should see "Connected to the Tor controller".
ta: வெங்காயத்தைத் திறந்து, அதில் உள்ள "⚙" ஐகானைக் சொடுக்கு செய்து, TOR அமைப்புகள் தாவலுக்கு மாறவும். "வெங்காயம் எவ்வாறு டோருடன் இணைக்க வேண்டும்?" "கட்டுப்பாட்டு போர்ட்டைப் பயன்படுத்தி இணைக்கவும்" என்பதைத் தேர்ந்தெடுத்து, "கட்டுப்பாட்டு துறைமுகம்" ஐ `` 127.0.0.1`` மற்றும் "துறைமுகம்" க்கு `` 9051`` என அமைக்கவும். "டோர் அங்கீகார அமைப்புகள்" கீழ் "கடவுச்சொல்" என்பதைத் தேர்ந்தெடுத்து, நீங்கள் மேலே தேர்ந்தெடுத்த கட்டுப்பாட்டு துறைமுகம் கடவுச்சொல்லுக்கு கடவுச்சொல்லை அமைக்கவும். "TOR க்கு இணைப்பு சோதனை" பொத்தானைக் சொடுக்கு செய்க. எல்லாம் சரியாக நடந்தால், "டோர் கன்ட்ரோலருடன் இணைக்கப்பட்டுள்ள" என்பதை நீங்கள் காண வேண்டும்.

source: Using a system ``tor`` in macOS
ta: MACOS இல் `` TOR`` ஒரு அமைப்பைப் பயன்படுத்துதல்

source: First, install `Homebrew <https://brew.sh/>`_ if you don't already have it, and then install Tor::
ta: முதலில், `ஓம்பிரூ <https://brew.sh/>` _ உங்களிடம் ஏற்கனவே இல்லையென்றால் நிறுவவும், பின்னர் டோர் :: நிறுவவும்

source: Now configure Tor to allow connections from OnionShare::
ta: இப்போது வெங்காயத்தில் இருந்து இணைப்புகளை அனுமதிக்க TOR ஐ உள்ளமைக்கவும் ::

source: And start the system Tor service::
ta: கணினி டோர் சேவையைத் தொடங்கவும் ::

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file", and set the socket file to be ``/usr/local/var/run/tor/control.socket``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
ta: வெங்காயத்தைத் திறந்து, அதில் உள்ள "⚙" ஐகானைக் சொடுக்கு செய்து, TOR அமைப்புகள் தாவலுக்கு மாறவும். "வெங்காயம் எவ்வாறு டோருடன் இணைக்க வேண்டும்?" "சாக்கெட் கோப்பைப் பயன்படுத்தி இணைக்கவும்" என்பதைத் தேர்வுசெய்து, சாக்கெட் கோப்பை ``/usr/local/var/run/tor/control.socket`` ஆக அமைக்கவும். "டோர் அங்கீகார அமைப்புகள்" கீழ் "ஏற்பு இல்லை, அல்லது குக்கீ ஏற்பு இல்லை" என்பதைத் தேர்வுசெய்க. "TOR க்கு இணைப்பு சோதனை" பொத்தானைக் சொடுக்கு செய்க.

source: If all goes well, you should see "Connected to the Tor controller".
ta: எல்லாம் சரியாக நடந்தால், "டோர் கன்ட்ரோலருடன் இணைக்கப்பட்டுள்ள" என்பதை நீங்கள் காண வேண்டும்.

source: Using a system ``tor`` in Linux
ta: லினக்சில் `` டோர்`` ஒரு கணினியைப் பயன்படுத்துதல்

source: First, install the ``tor`` package. If you're using Debian, Ubuntu, or a similar Linux distro, It is recommended to use the Tor Project's `official repository <https://support.torproject.org/apt/tor-deb-repo/>`_.
ta: முதலில், `` TOR`` தொகுப்பை நிறுவவும். நீங்கள் டெபியன், உபுண்டு அல்லது இதேபோன்ற லினக்ச் டிச்ட்ரோவைப் பயன்படுத்துகிறீர்கள் என்றால், டோர் திட்டத்தின் `அதிகாரப்பூர்வ களஞ்சியத்தை <https://support.torproject.org/apt/tor-deb-repo/>` _.

source: Next, add your user to the group that runs the ``tor`` process (in the case of Debian and Ubuntu, ``debian-tor``) and configure OnionShare to connect to your system ``tor``'s control socket file.
ta: அடுத்து, `` டோர்`` செயல்முறையை இயக்கும் குழுவில் உங்கள் பயனரைச் சேர்க்கவும் (டெபியன் மற்றும் உபுண்டு விசயத்தில், `டெபியன்-டோர்```) மற்றும் உங்கள் கணினியுடன் இணைக்க வெங்காயத்தை உள்ளமைக்கவும்` `டோர்`` சாக்கெட் கோப்பு.

source: Add your user to the ``debian-tor`` group by running this command (replace ``username`` with your actual username)::
ta: இந்த கட்டளையை இயக்குவதன் மூலம் உங்கள் பயனரை `` டெபியன்-டோர்`` குழுவில் சேர்க்கவும் (உங்கள் உண்மையான பயனர்பெயருடன் `` பயனர்பெயர்` ஐ மாற்றவும்) ::

source: Reboot your computer. After it boots up again, open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file". Set the socket file to be ``/var/run/tor/control``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
ta: உங்கள் கணினியை மீண்டும் துவக்கவும். அது மீண்டும் துவங்கிய பிறகு, வெங்காயத்தைத் திறந்து, அதில் உள்ள "⚙" ஐகானைக் சொடுக்கு செய்து, TOR அமைப்புகள் தாவலுக்கு மாறவும். "வெங்காயம் எவ்வாறு டோருடன் இணைக்க வேண்டும்?" "சாக்கெட் கோப்பைப் பயன்படுத்தி இணைக்கவும்" என்பதைத் தேர்வுசெய்க. சாக்கெட் கோப்பை ``/var/run/tor/control`` ஆக அமைக்கவும். "டோர் அங்கீகார அமைப்புகள்" கீழ் "ஏற்பு இல்லை, அல்லது குக்கீ ஏற்பு இல்லை" என்பதைத் தேர்வுசெய்க. "TOR க்கு இணைப்பு சோதனை" பொத்தானைக் சொடுக்கு செய்க.
